from F import F


def test_1_F():
    listOfNames = ['Арина', 'Павел', 'Стефания', 'Анастасия', 'Захар', 'Александр', 'Николай', 'Тимофей', 'Марсель',
                   'Ясмина', 'София', 'Вероника', 'Иван', 'Матвей', 'Елизавета', 'Полина', 'Михаил', 'Александра',
                   'Эмилия', 'Мирон']

    assert len(F(listOfNames, 100))==100

def test_2_F():
    listOfNames = ['Арина', 'Павел', 'Стефания', 'Анастасия', 'Захар', 'Александр', 'Николай', 'Тимофей', 'Марсель',
                   'Ясмина', 'София', 'Вероника', 'Иван', 'Матвей', 'Елизавета', 'Полина', 'Михаил', 'Александра',
                   'Эмилия', 'Мирон']

    assert len(F(listOfNames, 5))==5